<?php
return array(
  1=>['name'=>'หนอนพิษ','lv'=>1,'hp'=>52,'mp'=>10,'atk'=>6,'def'=>3,'exp'=>5,'money'=>4,'item'=>'6,2:7,2'],
  2=>['name'=>'ผีเสื้อปีกดำ','lv'=>2,'hp'=>40,'mp'=>15,'atk'=>13,'def'=>9,'exp'=>6,'money'=>5,'item'=>'6,2:7,2'],
  3=>['name'=>'หมาป่า','lv'=>3,'hp'=>51,'mp'=>15,'atk'=>14,'def'=>10,'exp'=>5,'money'=>3,'item'=>'6,2:7,2'],
  4=>['name'=>'หมาป่าน้ำตาล','lv'=>4,'hp'=>70,'mp'=>30,'atk'=>21,'def'=>15,'exp'=>9,'money'=>8,'item'=>'8,100:9,100:10,100:11,100:12,100'],
  5=>['name'=>'หมีแดง','lv'=>5,'hp'=>69,'mp'=>32,'atk'=>25,'def'=>17,'exp'=>11,'money'=>12,'item'=>'13,100:14,100:15,100'],
  6=>['name'=>'งูเขียว','lv'=>6,'hp'=>70,'mp'=>21,'atk'=>18,'def'=>25,'exp'=>15,'money'=>13,'item'=>'28,5:29,5:'],
  7=>['name'=>'นักรบกระดูก','lv'=>7,'hp'=>80,'mp'=>26,'atk'=>29,'def'=>15,'exp'=>21,'money'=>18,'item'=>'28,5:29,5:'],
  8=>['name'=>'มือธนูกระดูก','lv'=>8,'hp'=>143,'mp'=>25,'atk'=>34,'def'=>18,'exp'=>28,'money'=>22,'item'=>'16,100:17,100:18,100:19,100:20,100:21,100:22,100:23,100:24,100'],
  9=>['name'=>'นักเวทย์กระดูก','lv'=>9,'hp'=>165,'mp'=>45,'atk'=>35,'def'=>25,'exp'=>32,'money'=>28,'item'=>'25,100:26,100:27,100'],
  10=>['name'=>'หัวหน้าปีศาจกระดูก','lv'=>10,'hp'=>230,'mp'=>30,'atk'=>40,'def'=>35,'exp'=>38,'money'=>30,'item'=>'16,100:17,100:18,100:19,100:20,100:21,100:22,100:23,100:24,100:25,100:26,100:27,100:28,0:29,0'],
  11=>['name'=>'มือธนูออร์ค','lv'=>15,'hp'=>380,'mp'=>55,'atk'=>65,'def'=>59,'exp'=>58,'money'=>59,'item'=>''],
  12=>['name'=>'นักดาบออร์ค','lv'=>16,'hp'=>410,'mp'=>55,'atk'=>63,'def'=>65,'exp'=>65,'money'=>62,'item'=>''],
  13=>['name'=>'นักเวทย์ออร์ค','lv'=>17,'hp'=>450,'mp'=>110,'atk'=>72,'def'=>45,'exp'=>72,'money'=>68,'item'=>'']
);


?>