<div style="padding:10px 10px; background:#fff;">
<div style="padding:5px 10px; background-color:#fff; border-radius:3px; box-shadow:3px 3px 0px #f0f0f0; border:1px solid #ccc; line-height:2em">
<div style="text-align:left">
<?php if($this->path[1]=='privacy'):?>
  <h3>เงื่อนไขการสมัครเป็นสมาชิก Jarm / Jarm App</h3>
  <ol>
    <li>การสมัครสมาชิกกับทาง Jarm ผู้สมัครไม่ต้องเสียค่าใช้จ่ายใดๆ ทั้งสิ้น นอกจากการซื้อขายสินค้าระหว่างสมาชิกด้วยกันเอง</li>
    <li>Jarm เป็นเพียงสื่อกลางที่ให้บริการสังคมออนไลน์ ซึ่งมีสมาชิกเป็นจำนวนมาก ทางทีมงานอาจดูแลไม่ทั่วถึง</li>
    <li>ผู้ที่สมัครสมาชิกต้องกรอกอีเมล์ที่ใช้งานได้จริงเท่านั้น เพราะจะใช้เป็น Username ใช้ในการล็อกอินเข้าสู่ระบบ และชื่อที่เป็นนามแฝงสามารถใช้ภาษาไทยได้ รวมทั้งรูปประจำตัว ต้องไม่หยาบคาย หรือส่อไปในทางลามกอนาจาร</li>
    <li>การกระทำใดๆ ที่เป็นการเผยแพร่ของสมาชิก ให้ถือเป็นการกระทำที่อยู่ภายใต้ความรับผิดชอบของสมาชิกแต่เพียงผู้เดียว jarm.com ไม่มีส่วนเกี่ยวข้องและรับผิดชอบใดๆ ทั้งสิ้น</li>
    <li>สมาชิกห้ามเผยแพร่ เขียนข้อความ อ้างอิง พาดพิง ดูหมิ่น เหยียดสีผิว หรือกระทำการใดๆ ที่ก่อให้เกิดความเสียหายต่อสถาบัน ชาติ ศาสนา และพระมหากษัตริย์</li>
    <li>สมาชิกห้ามเผยแพร่ข้อมูลที่ส่อเสียด ให้ร้ายผู้อื่น หรือให้เกิดความเสียหายชื่อเสียง และความเป็นส่วนตัว ต่อบุคคลหนึ่งบุคคลใด หากมีการฟ้องร้อง ทาง jarm.com จะไม่มีส่วนรับผิดชอบใดๆ ทั้งสิ้น</li>
    <li>สมาชิกต้องเก็บรหัสผ่านไว้เป็นความรับ เพื่อป้องกันไม่ให้ผู้อื่นใช้แอคเคานท์ของท่านเข้าสู่ระบบ เพื่อกระทำการใดๆ ที่ก่อให้เกิดความเสียหายต่อตัวท่านเอง และระบบโดยรวม</li>
    <li>ห้ามสมาชิกเผยแพร่ข้อมูล ภาพ เสียง หรือข้อความ ที่ส่อไปในทางทุจริต ลามกอนาจาร ผิดกฏหมายและศีลธรรม รวมทั้งข้อมูลประเภท Pirate software, Crack, Hack</li>
    <li>ห้ามจำหน่ายหรือเผยแพร่สินค้าและเว็บไซต์ที่ละเมิดลิขสิทธิ์ เครื่องหมายการค้า หรือทรัพย์สินทางปัญญาของผู้อื่น โดยจะมีโทษตามกฏหมายสูงสุด</li>
    <li>ข้อมูลส่วนตัวของสมาชิก จะถือเป็นความลับ และจะไม่ถูกเปิดเผย ต่อผู้อื่นหรือสาธารณะ และจะไม่ถูกนำไปใช้ในทางการค้า หรือจำหน่ายให้บุคคลอื่น</li>
    <li>ผู้ใช้บริการต้องยอมรับว่า jarm.com เป็นสังคมออนไลน์ที่มีสมาชิกจากทั่วประเทศ หลายชนชั้น อาจก่อให้เกิดภัยสังคมทั้งทางตรงหรือทางอ้อม เพราะฉะนั้นไม่ควรเชื่อคำชักชวนใครง่ายๆ</li>
    <li>หากสมาชิกพบปัญหาการใช้งาน พบเห็นข้อมูล ถูกแอบอ้าง หรือการกระทำใดๆ ที่ไม่เหมาะสม ก่อให้เกิดผลเสียต่อท่าน บุคคลอื่น  หรือระบบเว็บไซต์ สามารถแจ้งต่อทีมงานได้โดยทันที</li>
  </ol>
<?php else:?>
  <h3>Jarm & BoxzaRacing Team.</h3>
  <div style="text-align:center">
    <img src="https://cdn.jarm.com/img/global/team.jpg" class="img-responsive">
  </div>
  <ul>
    <li>CEO</li>
    <li>Accounting</li>
    <li>Jarm Content</li>
    <li>Jarm Racing Content</li>
    <li>Programmer</li>
    <li>Graphic Design</li>
    <li>Production</li>
    <li>Video Editor</li>
    <li>Photographer</li>
    <li>Sale</li>
    <li>Administration</li>
  </ul>
<?php endif?>
</div>
</div>
</div>
